information.org
* Instructions
** Requirements
   Running Linux or you must use the Arduino-IDE to compile and flash the code.
   This isn't covered here but it is on https://github.com/xoseperez/espurna/wiki/ArduinoIDE.
   Have pio, esptool, gcc installed.
   
** Hardware
*** Materials
    See spreadsheet for Amazon links and prices.
    Estimated cost to make one is between $70 and $150 at the time of making this guide, depending on what you have already.
    https://docs.google.com/spreadsheets/d/1ye8_F2U_gymXYMMUUAUZvnKoF8kuvBFObCXN0axRH-A/edit?usp=sharing
    
**** Project Box
     Something sorta water resistant (don't want to spill water on it and wreck it) to put your electronics and pump into.
     You also have to be able to get the hoses out and power into the box.
     I would just use a small cardboard box to start. Once everything is assembled you can
     pick out a proper plastic box to order on Amazon depending on what you want it to
     look like and the size you would like. I purchased two of these, one for the motor
     and one for the electronics in case of leaks.
     
**** Control Board with WiFi
     An ESP8266 device, I used the NodeMCU-12E board available on Amazon and elsewhere.
     This board should be capable of running at 5V to switch a 5V relay. The NodeMCU-12E
     is rated for 3.3V but can usually run at 5V without issue.
     
**** Relay
     A 5V relay that can switch 8-12 volts DC.
     You connect the motor power through this, and the ESP8266 can tell it to turn the motor on and off.
     
**** Button (optional)
     Just a push button from an arduino kit.
     
**** Float Sensor
     Something to tell you when the water level is low so your plant doesn't die.
     
**** Wire
     Just some extra wire to conenct things with.
     
**** Parastolic Pump
     A small parastolic pump.
     5 Watts is what I purchased.
     It should run at a decent speed when powered by whatever power supply you selected.

**** Silicone Tube
     Sized that it can be connected to the parastolic pump. If the pump says it works with 6mm OD, 4mm ID then buy that.
     More than a meter worth but depends on the reseviour and plants you intend to water.

**** Power Supply
     >= 5 watts, 8-12V.
     Nice to have a switch on it.
     The end cut off so its just two wires; mark the positive and negative with a volt meter if it isn't marked.
     I grabbed an old LED light power supply.
     This should be the right voltage for the parastalic pump you selected with maybe an amp more than the motor requires.

**** Prototype board (Optional)
     Optional but makes a nicer final product than just connecting wires to each other.
     The one I linked also comes with nice little screw terminals to allow disconnecting wires easily.

**** Breadboard and jumpers
     To make initial connections and debug issues without soldering and in a more organized manner than twisting wires.

**** 5 Volt Regulator
     Can take the output of your power supply as input to create 5V.

     Very useful for other projects, variable output voltage (just set it to 5V with a volt meter).
     You can also use these if you have a higher voltage power supply, just also regulate the motor voltage with another one.

**** Heat Shrink Tubing / Electrical Tape
     Or electrical tape to cover wire connections and prevent shorting.

**** Soldering Iron (Optional)
     Optional but recommended to connect wires together and use the prototype board.

**** Volt Meter
     To check polarity and voltages and such.
     
*** Assembly
    If a pin is specified without telling you what its on, its on the ESP8266 WiFi board.
    All the pins on the ESP8266 board we will be dealing with are on the same side, the ones labeled D1, D2...
    
**** Power Supply
     Make two connections come off of both wires (4 total, two negative/black and two positive/red).
     Connect one pair of positive/red and negative/black to the correct inputs of the 5V regulator.
     
**** ESP8266 WiFi Controller
     Connect the positive/red output from the 5V regulator to one of the 3V3 pins.
     Note: We are connecting 5V to the 3.3V pins and Not the 5V input pin. The relay requires 5V so we have to
     run the ESP8266 over voltage at 5V so the data pins can switch the relay. This may shorten the life of the
     ESP8266 depending on which one you buy.
     Connect the negative/black output from the 5V regulator to one of the GND pins.
    
**** Float Sensor
     Connect one side to a GND pin and label it negative/black.
     The other side goes to D6 and label it positive/red.

**** Button
     Connect one side to a GND pin.
     The other side goes to D5.
     
