information.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-20 Tue 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org90b6c9c">1. Instructions</a>
<ul>
<li><a href="#org62e7e77">1.1. Requirements</a></li>
<li><a href="#org868c60e">1.2. Hardware</a>
<ul>
<li><a href="#org368a6cf">1.2.1. Materials</a></li>
<li><a href="#org46991d9">1.2.2. Assembly</a></li>
</ul>
</li>
<li><a href="#orga73bdfb">1.3. Software</a>
<ul>
<li><a href="#org27efeb9">1.3.1. Clone Repos</a></li>
<li><a href="#org6271fad">1.3.2. Building ESPurna</a></li>
<li><a href="#org191050b">1.3.3. Configure ESPurna</a></li>
<li><a href="#orge2a5334">1.3.4. Install HomeAssistant</a></li>
<li><a href="#orgdc51cfe">1.3.5. Configure HomeAssistant</a></li>
<li><a href="#org97281e9">1.3.6. Problems and Solutions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org90b6c9c" class="outline-2">
<h2 id="org90b6c9c"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org62e7e77" class="outline-3">
<h3 id="org62e7e77"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Running Linux or you must use the Arduino-IDE to compile and flash the code.
This isn't covered here but it is on <a href="https://github.com/xoseperez/espurna/wiki/ArduinoIDE">https://github.com/xoseperez/espurna/wiki/ArduinoIDE</a>.
Have pio, esptool, gcc installed.
</p>
</div>
</div>

<div id="outline-container-org868c60e" class="outline-3">
<h3 id="org868c60e"><span class="section-number-3">1.2</span> Hardware</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org368a6cf" class="outline-4">
<h4 id="org368a6cf"><span class="section-number-4">1.2.1</span> Materials</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
See spreadsheet for Amazon links and prices.
Estimated cost to make one is between $70 and $150 at the time of making this guide, depending on what you have already.
<a href="https://docs.google.com/spreadsheets/d/1ye8_F2U_gymXYMMUUAUZvnKoF8kuvBFObCXN0axRH-A/edit?usp=sharing">https://docs.google.com/spreadsheets/d/1ye8_F2U_gymXYMMUUAUZvnKoF8kuvBFObCXN0axRH-A/edit?usp=sharing</a>
</p>
</div>

<ol class="org-ol">
<li><a id="org5a61f5a"></a>Project Box<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Something sorta water resistant (don't want to spill water on it and wreck it) to put your electronics and pump into.
You also have to be able to get the hoses out and power into the box.
I would just use a small cardboard box to start. Once everything is assembled you can
pick out a proper plastic box to order on Amazon depending on what you want it to
look like and the size you would like. I purchased two of these, one for the motor
and one for the electronics in case of leaks.
</p>
</div>
</li>

<li><a id="orgf66975a"></a>Control Board with WiFi<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
An ESP8266 device, I used the NodeMCU-12E board available on Amazon and elsewhere.
This board should be capable of running at 5V to switch a 5V relay. The NodeMCU-12E
is rated for 3.3V but can usually run at 5V without issue.
</p>
</div>
</li>

<li><a id="org1347908"></a>Relay<br />
<div class="outline-text-5" id="text-1-2-1-3">
<p>
A 5V relay that can switch 8-12 volts DC.
You connect the motor power through this, and the ESP8266 can tell it to turn the motor on and off.
</p>
</div>
</li>

<li><a id="org711c9c9"></a>Button (optional)<br />
<div class="outline-text-5" id="text-1-2-1-4">
<p>
Just a push button from an arduino kit.
</p>
</div>
</li>

<li><a id="org879227b"></a>Float Sensor<br />
<div class="outline-text-5" id="text-1-2-1-5">
<p>
Something to tell you when the water level is low so your plant doesn't die.
</p>
</div>
</li>

<li><a id="org872f5c9"></a>Wire<br />
<div class="outline-text-5" id="text-1-2-1-6">
<p>
Just some extra wire to conenct things with.
</p>
</div>
</li>

<li><a id="orgb169562"></a>Parastolic Pump<br />
<div class="outline-text-5" id="text-1-2-1-7">
<p>
A small parastolic pump.
5 Watts is what I purchased.
It should run at a decent speed when powered by whatever power supply you selected.
</p>
</div>
</li>

<li><a id="org33b6c6f"></a>Silicone Tube<br />
<div class="outline-text-5" id="text-1-2-1-8">
<p>
Sized that it can be connected to the parastolic pump. If the pump says it works with 6mm OD, 4mm ID then buy that.
More than a meter worth but depends on the reseviour and plants you intend to water.
</p>
</div>
</li>

<li><a id="org6fcaa34"></a>Power Supply<br />
<div class="outline-text-5" id="text-1-2-1-9">
<p>
&gt;= 5 watts, 8-12V.
Nice to have a switch on it.
The end cut off so its just two wires; mark the positive and negative with a volt meter if it isn't marked.
I grabbed an old LED light power supply.
This should be the right voltage for the parastalic pump you selected with maybe an amp more than the motor requires.
</p>
</div>
</li>

<li><a id="org7c8f39b"></a>Prototype board (Optional)<br />
<div class="outline-text-5" id="text-1-2-1-10">
<p>
Optional but makes a nicer final product than just connecting wires to each other.
The one I linked also comes with nice little screw terminals to allow disconnecting wires easily.
</p>
</div>
</li>

<li><a id="org2f9e017"></a>Breadboard and jumpers<br />
<div class="outline-text-5" id="text-1-2-1-11">
<p>
To make initial connections and debug issues without soldering and in a more organized manner than twisting wires.
</p>
</div>
</li>

<li><a id="org6b6ec4c"></a>5 Volt Regulator<br />
<div class="outline-text-5" id="text-1-2-1-12">
<p>
Can take the output of your power supply as input to create 5V.
</p>

<p>
Very useful for other projects, variable output voltage (just set it to 5V with a volt meter).
You can also use these if you have a higher voltage power supply, just also regulate the motor voltage with another one.
</p>
</div>
</li>

<li><a id="org99778d8"></a>Heat Shrink Tubing / Electrical Tape<br />
<div class="outline-text-5" id="text-1-2-1-13">
<p>
Or electrical tape to cover wire connections and prevent shorting.
</p>
</div>
</li>

<li><a id="org17b213e"></a>Soldering Iron (Optional)<br />
<div class="outline-text-5" id="text-1-2-1-14">
<p>
Optional but recommended to connect wires together and use the prototype board.
</p>
</div>
</li>

<li><a id="orgd3d65c3"></a>Volt Meter<br />
<div class="outline-text-5" id="text-1-2-1-15">
<p>
To check polarity and voltages and such.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org46991d9" class="outline-4">
<h4 id="org46991d9"><span class="section-number-4">1.2.2</span> Assembly</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
If a pin is specified without telling you what its on, its on the ESP8266 WiFi board.
All the pins on the ESP8266 board we will be dealing with are on the same side, the ones labeled D1, D2&#x2026;
</p>
</div>

<ol class="org-ol">
<li><a id="orgc90cf89"></a>Power Supply<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Make two connections come off of both wires (4 total, two negative/black and two positive/red).
Connect one pair of positive/red and negative/black to the correct inputs of the 5V regulator.
</p>
</div>
</li>

<li><a id="orgd32e478"></a>ESP8266 WiFi Controller<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
Connect the positive/red output from the 5V regulator to one of the 3V3 pins.
Note: We are connecting 5V to the 3.3V pins and Not the 5V input pin. The relay requires 5V so we have to
run the ESP8266 over voltage at 5V so the data pins can switch the relay. This may shorten the life of the
ESP8266 depending on which one you buy.
Connect the negative/black output from the 5V regulator to one of the GND pins.
</p>
</div>
</li>

<li><a id="org93b027a"></a>Float Sensor<br />
<div class="outline-text-5" id="text-1-2-2-3">
<p>
Connect one side to a GND pin and label it negative/black.
The other side goes to D6 and label it positive/red.
</p>
</div>
</li>

<li><a id="orga10bf22"></a>Button<br />
<div class="outline-text-5" id="text-1-2-2-4">
<p>
Connect one side to a GND pin.
The other side goes to D5.
</p>
</div>
</li>
