information.org
**** Relay
     For different relays this is different but the instructions for the relay I had follow.
     Generally, you want the relay coil going to GND and D7, one side of the switch going to the power supply GND and the other side going to the motor GND.
     Also I am using a normally closed relay. If you have a normally open relay you need to change RELAY1_TYPE from RELAY_TYPE_NORMAL to RELAY_TYPE_INVERSE.
     See https://github.com/xoseperez/espurna/wiki/Buttons-and-switches.
     
     We will label the relay pins as such:
     #+BEGIN_SRC
     +------+
     |*    *|
     |      |
     |      |
     |      |
     |*    *|
     |*    *|
     +------+
     #+END_SRC
     - top left as R1
     - top right as R2
     - middle left as R3
     - middle right as R4
     - bottom left as R5
     - bottom right as R6  

     To figure out which side of the relay is normally open, use your multimeter to test for continuity between
     R6 to R2, then R5 to R1. Which ever pair is not connected is the normally open pair. Use that pair for below.  
       
     - One of R3 or R4 goes to D7, the other goes to GND.
     - Connect either R1 or R2 (the normally open one) to the power supply negative/black.
     - Connect eitther R5 or R6 (the normally open one) to the motor's negative/black.

**** Motor
     Connect the positive/red to the power supply positive/red.
     The negative/black should be connected to the relay.

     
** Software
*** Clone Repos
   Clone/download this repo and its submodules to your computer.
   Use `git clone --recurse-submodules https://github.com/eightys3v3n/plant_water.git`.
   
   If you just download a zip of the repository, you must also go download a zip of the latest espurna repository
   and put it in the espurna folder inside plant_water.
   Download it from https://github.com/eightys3v3n/espurna/tree/plant_water.
   The directory tree should look like this when you're ready.
   #+BEGIN_SRC
   plant_water/
     espurna/
       code/
       firmware/
       ...
     information.org
   #+END_SRC
   
*** Building ESPurna
    Naviage to plant_water/espurna/code.
    
**** Edits
     Only the credentials.h file is required to be edited. The other two are just things you can edit if need be.
     The code included is an example of the file contents, see the actual files for up to date contents.
     
***** WiFi Credentials
      `code/espurna/config/credentials.h`
      
      You have to make this file, but you don't have to have anything in it.
      You can set this up once you flash the ESP8266 by connecting to its WiFi network, it just takes longer
      than setting them in this file.
      If you plan on using HomeAssistant you'll probably have to set up MQTT after you setup Home Assistant's built in broker.
      You can comment out the MQTT stuff to just not set it until later.
      #+BEGIN_SRC
 #define WEB_USERNAME "Username for ESPurna web interface"
 #define ADMIN_PASS "Password for ESPurna web interface"

 #define WIFI1_SSID "SSID for 2.4Ghz WiFi"
 #define WIFI1_PASS "Password for WiFi"

 #define MQTT_AUTOCONNECT 1
 #define MQTT_USER "MQTT server username"
 #define MQTT_PASS "MQTT server password"
 #define MQTT_PORT 1883
 #define MQTT_SERVER "MQTT server IP address"
 #define MQTT_QOS 2
      #+END_SRC

***** ESP8266 Memory
      `code/platformio_override.ini`
      
      -4m- is the megabytes of memory on the selected ESP8266 device. You may need to change this to 1m if you have a
      board with less memory.
      #+BEGIN_SRC
 [env:plant_water]
 extends = env:esp8266-4m-base
 src_build_flags = -DUSE_CUSTOM_H
      #+END_SRC

