information.html

<li><a id="orgc0c8bad"></a>Relay<br />
<div class="outline-text-5" id="text-1-2-2-5">
<p>
For different relays this is different but the instructions for the relay I had follow.
Generally, you want the relay coil going to GND and D7, one side of the switch going to the power supply GND and the other side going to the motor GND.
Also I am using a normally closed relay. If you have a normally open relay you need to change RELAY1_TYPE from RELAY_TYPE_NORMAL to RELAY_TYPE_INVERSE.
See <a href="https://github.com/xoseperez/espurna/wiki/Buttons-and-switches">https://github.com/xoseperez/espurna/wiki/Buttons-and-switches</a>.
</p>

<p>
We will label the relay pins as such:
</p>
<pre class="example">
+------+
|*    *|
|      |
|      |
|      |
|*    *|
|*    *|
+------+
</pre>
<ul class="org-ul">
<li>top left as R1</li>
<li>top right as R2</li>
<li>middle left as R3</li>
<li>middle right as R4</li>
<li>bottom left as R5</li>
<li>bottom right as R6</li>
</ul>

<p>
To figure out which side of the relay is normally open, use your multimeter to test for continuity between
R6 to R2, then R5 to R1. Which ever pair is not connected is the normally open pair. Use that pair for below.  
</p>

<ul class="org-ul">
<li>One of R3 or R4 goes to D7, the other goes to GND.</li>
<li>Connect either R1 or R2 (the normally open one) to the power supply negative/black.</li>
<li>Connect eitther R5 or R6 (the normally open one) to the motor's negative/black.</li>
</ul>
</div>
</li>

<li><a id="org7020ee7"></a>Motor<br />
<div class="outline-text-5" id="text-1-2-2-6">
<p>
Connect the positive/red to the power supply positive/red.
The negative/black should be connected to the relay.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-orga73bdfb" class="outline-3">
<h3 id="orga73bdfb"><span class="section-number-3">1.3</span> Software</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org27efeb9" class="outline-4">
<h4 id="org27efeb9"><span class="section-number-4">1.3.1</span> Clone Repos</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Clone/download this repo and its submodules to your computer.
Use `git clone &#x2013;recurse-submodules <a href="https://github.com/eightys3v3n/plant_water.git">https://github.com/eightys3v3n/plant_water.git</a>`.
</p>

<p>
If you just download a zip of the repository, you must also go download a zip of the latest espurna repository
and put it in the espurna folder inside plant_water.
Download it from <a href="https://github.com/eightys3v3n/espurna/tree/plant_water">https://github.com/eightys3v3n/espurna/tree/plant_water</a>.
The directory tree should look like this when you're ready.
</p>
<pre class="example">
plant_water/
  espurna/
    code/
    firmware/
    ...
  information.org
</pre>
</div>
</div>

<div id="outline-container-org6271fad" class="outline-4">
<h4 id="org6271fad"><span class="section-number-4">1.3.2</span> Building ESPurna</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Naviage to plant_water/espurna/code.
</p>
</div>

<ol class="org-ol">
<li><a id="org2972b05"></a>Edits<br />
<div class="outline-text-5" id="text-1-3-2-1">
<p>
Only the credentials.h file is required to be edited. The other two are just things you can edit if need be.
The code included is an example of the file contents, see the actual files for up to date contents.
</p>
</div>

<ol class="org-ol">
<li><a id="org821df82"></a>WiFi Credentials<br />
<div class="outline-text-6" id="text-1-3-2-1-1">
<p>
`code/espurna/config/credentials.h`
</p>

<p>
You have to make this file, but you don't have to have anything in it.
You can set this up once you flash the ESP8266 by connecting to its WiFi network, it just takes longer
than setting them in this file.
If you plan on using HomeAssistant you'll probably have to set up MQTT after you setup Home Assistant's built in broker.
You can comment out the MQTT stuff to just not set it until later.
</p>
<pre class="example">
#define WEB_USERNAME "Username for ESPurna web interface"
#define ADMIN_PASS "Password for ESPurna web interface"

#define WIFI1_SSID "SSID for 2.4Ghz WiFi"
#define WIFI1_PASS "Password for WiFi"

#define MQTT_AUTOCONNECT 1
#define MQTT_USER "MQTT server username"
#define MQTT_PASS "MQTT server password"
#define MQTT_PORT 1883
#define MQTT_SERVER "MQTT server IP address"
#define MQTT_QOS 2
</pre>
</div>
</li>

<li><a id="orgdc9aff4"></a>ESP8266 Memory<br />
<div class="outline-text-6" id="text-1-3-2-1-2">
<p>
`code/platformio_override.ini`
</p>

<p>
-4m- is the megabytes of memory on the selected ESP8266 device. You may need to change this to 1m if you have a
board with less memory.
</p>
<pre class="example">
[env:plant_water]
extends = env:esp8266-4m-base
src_build_flags = -DUSE_CUSTOM_H
</pre>
</div>
</li>
