information.org
***** Data Pins and Features
      `code/espurna/config/custom.h`
      
      Converting pin numbers from D0, D1... to code compatible https://randomnerdtutorials.com/esp8266-pinout-reference-gpios/.
      LED1_PIN 2 means the LED is connected to GPIO2, which is correct for NodeMCU 1.0 devices but changes for other ESP8266 devices. If not sure comment this whole section out.
      RELAY1_PIN 13 means we connect the relay switch to pin D7.
      BUTTON2_PIN 14 means we connect the button to D5.
      DIGITAL1_PIN 12 means we connect the float sensor to D6.
      The button2 stuff lets you use your extra button to turn on and off the sensor. Information about how to customize it is on the wiki.
      The other configuration options have details at https://github.com/xoseperez/espurna/wiki.
      #+BEGIN_SRC
 // Prevents checking of default options for this board.
 #define MANUFACTURER        "NODEMCU"
 #define DEVICE              "LOLIN"


 // Features
 #define ALEXA_SUPPORT          0
 #define API_SUPPORT            1
 #define BUTTON_SUPPORT         0
 #define DEBUG_SERIAL_SUPPORT   1
 #define DEBUG_TELNET_SUPPORT   0
 #define DEBUG_UDP_SUPPORT      0
 #define DEBUG_WEB_SUPPORT      1
 #define DOMOTICZ_SUPPORT       0
 #define ENCODER_SUPPORT        1
 #define HOMEASSISTANT_SUPPORT  1
 #define I2C_SUPPORT            0
 #define INFLUXDB_SUPPORT       0
 #define IR_SUPPORT             0
 #define LED_SUPPORT            1
 #define LLMNR_SUPPORT          0
 #define MDNS_SERVER_SUPPORT    0
 #define MQTT_SUPPORT           1
 #define NETBIOS_SUPPORT        0
 #define NOFUSS_SUPPORT         1
 #define NTP_SUPPORT            1
 #define OTA_ARDUINOOTA_SUPPORT 0
 #define RFM69_SUPPORT          0
 #define RFB_SUPPORT            0
 #define RPN_RULES_SUPPORT      0
 #define SCHEDULER_SUPPORT      1
 #define SPIFFS_SUPPORT         0
 #define SSDP_SUPPORT           0
 #define TELNET_SUPPORT         0
 #define TERMINAL_SUPPORT       1
 #define TERMINAL_MQTT_SUPPORT  0
 #define TERMINAL_WEB_API_SUPPORT 0
 #define THINGSPEAK_SUPPORT     0
 #define TUYA_SUPPORT           0
 #define UART_MQTT_SUPPORT      0
 #define WEB_SUPPORT            1


 // Sensors
 #define ADE7953_SUPPORT        0
 #define AM2320_SUPPORT         0
 #define ANALOG_SUPPORT         0
 #define BH1750_SUPPORT         0
 #define BMP180_SUPPORT         0
 #define BMX280_SUPPORT         0
 #define BME680_SUPPORT         0
 #define CSE7766_SUPPORT        0
 #define DALLAS_SUPPORT         0
 #define DHT_SUPPORT            0
 #define DIGITAL_SUPPORT        1
 #define ECH1560_SUPPORT        0
 #define EMON_ADC121_SUPPORT    0
 #define EMON_ADS1X15_SUPPORT   0
 #define EMON_ANALOG_SUPPORT    0
 #define EVENTS_SUPPORT         0
 #define EZOPH_SUPPORT          0
 #define GEIGER_SUPPORT         0
 #define GUVAS12SD_SUPPORT      0
 #define HLW8012_SUPPORT        0
 #define LDR_SUPPORT            0
 #define MAX6675_SUPPORT        0
 #define MHZ19_SUPPORT          0
 #define MICS2710_SUPPORT       0
 #define MICS5525_SUPPORT       0
 #define NTC_SUPPORT            0
 #define PMSX003_SUPPORT        0
 #define PULSEMETER_SUPPORT     0
 #define PZEM004T_SUPPORT       0
 #define SDS011_SUPPORT         0
 #define SENSEAIR_SUPPORT       0
 #define SHT3X_I2C_SUPPORT      0
 #define SI7021_SUPPORT         0
 #define SONAR_SUPPORT          0
 #define T6613_SUPPORT          0
 #define THERMOSTAT_SUPPORT     0
 #define TMP3X_SUPPORT          0
 #define V9261F_SUPPORT         0
 #define VEML6075_SUPPORT       0
 #define VL53L1X_SUPPORT        0
 #define HDC1080_SUPPORT        0


 // Configuration
 #define LIGHT_SAVE_ENABLED 0
 #define BUTTON_MQTT_SEND_ALL_EVENTS 1
 #define MQTT_RETAIN 0
 #define MQTT_ENABLED 1
 #define HOMEASSISTANT_ENABLED 1

 // Make the built in LED flash on WiFi activity
 #define LED1_PIN 2
 #define LED1_PIN_INVERSE 1
 #define LED1_MODE LED_MODE_WIFI

 // For the motor relay
 #define RELAY1_PIN 13
 #define RELAY1_TYPE RELAY_TYPE_NORMAL
 #define RELAY1_PULSE_MODE RELAY_PULSE_OFF // defaults to being off (not watering)
 #define RELAY1_PULSE_TIME 20 // number of seconds the relay can stay on for

 // Built-in flash button
 #define BUTTON1_PIN 0
 #define BUTTON1_CONFIG BUTTON_PUSHBUTTON | BUTTON_DEFAULT_HIGH
 #define BUTTON1_LNGCLICK BUTTON_ACTION_NONE

 // Extra external button
 #define BUTTON2_PIN 14
 #define BUTTON2_CONFIG BUTTON_PUSHBUTTON | BUTTON_SET_PULLUP | BUTTON_DEFAULT_HIGH
 #define BUTTON2_PRESS BUTTON_ACTION_PULSE
 #define BUTTON2_CLICK BUTTON_ACTION_NONE
 #define BUTTON2_RELEASE BUTTON_ACTION_OFF
 #define BUTTON2_DBLCLICK BUTTON_ACTION_TOGGLE
 #define BUTTON2_RELAY 1

 // Float sensor
 #define DIGITAL1_PIN 12


 // Secret Configuration
 #include "credentials.h"
      #+END_SRC
     
**** Compile firmware
     Plug in the ESP8266 board via USB.

     Some times you may need to reflash the entire ESP8266 memory to avoid issues,
     Use `esptool.py erase_flash` to do that before running the above commands if you encounter random crashes.
     
     From espurna/code run `./build.sh` to compile the project and flash it to a connected deivce.
     
*** Configure ESPurna
    You also have to decide now if you want to run HomeAssistant to manage the watering device (more features and stuff)
    or just use the device its self (easier).
    Now that ESPurna is flashed, we have a few options we can change on the following tabs.
    Make sure to hit save on every page.

**** General
     Set the host name to something that makes sense like "PlantWater".

**** HASS
     - Enable discovery.
     - Leave the prefix as homeassistant if you don't know what this does. Its default.
     - Retain to yes. This means Home Assistant sees if the device has ever existed and adds it rather than waiting for it to say "Hello".

**** MQTT
     Enable if it isn't already.
     Also enter your HomeAssistant broker details here if you aren't using your own broker.
     This needs to be done after HomeAssistant is setup.
     
**** NPT
     Set your timezone by finding it in the list at https://github.com/esp8266/Arduino/blob/master/cores/esp8266/TZ.h.
     Then copy the bit between the quotes and paste it into the Time Zone field.

**** Schedule
     If you don't want to use HomeAssistant to control plant watering, just add a watering schedule here.
     With Pulse Mode on you should only have to set a turn on schedule, the switch will turn off after the pulse time.

**** Sensors
     - Read interval is how often to check whether the water is empty or not. Set it accordingly to something like 1 minute.
     - Change "Report every" to 1.

**** Switches
     Setting first, the value after the colons.
     
     - Boot mode :: Always Off
     - Pulse mode :: Normally Off
     - Pulse time :: The maximum time we should be able to water the plant. It auto-stops watering after this many seconds if you don't turn it off.
     - MQTT topic subscription :: Set this to something like "PlantWater/water" if using HomeAssistant. Home Assistant uses this to tell it to water the plants.
     - On MQTT disconnect :: Turn off

**** WiFi
     Here you can add more WiFi networks and change the WiFi password.
     If you only have one WiFi network, turn off Scan. This results in better performance when the WiFi signal is low.

