information.html

<li><a id="org2ede531"></a>Data Pins and Features<br />
<div class="outline-text-6" id="text-1-3-2-1-3">
<p>
`code/espurna/config/custom.h`
</p>

<p>
Converting pin numbers from D0, D1&#x2026; to code compatible <a href="https://randomnerdtutorials.com/esp8266-pinout-reference-gpios/">https://randomnerdtutorials.com/esp8266-pinout-reference-gpios/</a>.
LED1_PIN 2 means the LED is connected to GPIO2, which is correct for NodeMCU 1.0 devices but changes for other ESP8266 devices. If not sure comment this whole section out.
RELAY1_PIN 13 means we connect the relay switch to pin D7.
BUTTON2_PIN 14 means we connect the button to D5.
DIGITAL1_PIN 12 means we connect the float sensor to D6.
The button2 stuff lets you use your extra button to turn on and off the sensor. Information about how to customize it is on the wiki.
The other configuration options have details at <a href="https://github.com/xoseperez/espurna/wiki">https://github.com/xoseperez/espurna/wiki</a>.
</p>
<pre class="example">
// Prevents checking of default options for this board.
#define MANUFACTURER        "NODEMCU"
#define DEVICE              "LOLIN"


// Features
#define ALEXA_SUPPORT          0
#define API_SUPPORT            1
#define BUTTON_SUPPORT         0
#define DEBUG_SERIAL_SUPPORT   1
#define DEBUG_TELNET_SUPPORT   0
#define DEBUG_UDP_SUPPORT      0
#define DEBUG_WEB_SUPPORT      1
#define DOMOTICZ_SUPPORT       0
#define ENCODER_SUPPORT        1
#define HOMEASSISTANT_SUPPORT  1
#define I2C_SUPPORT            0
#define INFLUXDB_SUPPORT       0
#define IR_SUPPORT             0
#define LED_SUPPORT            1
#define LLMNR_SUPPORT          0
#define MDNS_SERVER_SUPPORT    0
#define MQTT_SUPPORT           1
#define NETBIOS_SUPPORT        0
#define NOFUSS_SUPPORT         1
#define NTP_SUPPORT            1
#define OTA_ARDUINOOTA_SUPPORT 0
#define RFM69_SUPPORT          0
#define RFB_SUPPORT            0
#define RPN_RULES_SUPPORT      0
#define SCHEDULER_SUPPORT      1
#define SPIFFS_SUPPORT         0
#define SSDP_SUPPORT           0
#define TELNET_SUPPORT         0
#define TERMINAL_SUPPORT       1
#define TERMINAL_MQTT_SUPPORT  0
#define TERMINAL_WEB_API_SUPPORT 0
#define THINGSPEAK_SUPPORT     0
#define TUYA_SUPPORT           0
#define UART_MQTT_SUPPORT      0
#define WEB_SUPPORT            1


// Sensors
#define ADE7953_SUPPORT        0
#define AM2320_SUPPORT         0
#define ANALOG_SUPPORT         0
#define BH1750_SUPPORT         0
#define BMP180_SUPPORT         0
#define BMX280_SUPPORT         0
#define BME680_SUPPORT         0
#define CSE7766_SUPPORT        0
#define DALLAS_SUPPORT         0
#define DHT_SUPPORT            0
#define DIGITAL_SUPPORT        1
#define ECH1560_SUPPORT        0
#define EMON_ADC121_SUPPORT    0
#define EMON_ADS1X15_SUPPORT   0
#define EMON_ANALOG_SUPPORT    0
#define EVENTS_SUPPORT         0
#define EZOPH_SUPPORT          0
#define GEIGER_SUPPORT         0
#define GUVAS12SD_SUPPORT      0
#define HLW8012_SUPPORT        0
#define LDR_SUPPORT            0
#define MAX6675_SUPPORT        0
#define MHZ19_SUPPORT          0
#define MICS2710_SUPPORT       0
#define MICS5525_SUPPORT       0
#define NTC_SUPPORT            0
#define PMSX003_SUPPORT        0
#define PULSEMETER_SUPPORT     0
#define PZEM004T_SUPPORT       0
#define SDS011_SUPPORT         0
#define SENSEAIR_SUPPORT       0
#define SHT3X_I2C_SUPPORT      0
#define SI7021_SUPPORT         0
#define SONAR_SUPPORT          0
#define T6613_SUPPORT          0
#define THERMOSTAT_SUPPORT     0
#define TMP3X_SUPPORT          0
#define V9261F_SUPPORT         0
#define VEML6075_SUPPORT       0
#define VL53L1X_SUPPORT        0
#define HDC1080_SUPPORT        0


// Configuration
#define LIGHT_SAVE_ENABLED 0
#define BUTTON_MQTT_SEND_ALL_EVENTS 1
#define MQTT_RETAIN 0
#define MQTT_ENABLED 1
#define HOMEASSISTANT_ENABLED 1

// Make the built in LED flash on WiFi activity
#define LED1_PIN 2
#define LED1_PIN_INVERSE 1
#define LED1_MODE LED_MODE_WIFI

// For the motor relay
#define RELAY1_PIN 13
#define RELAY1_TYPE RELAY_TYPE_NORMAL
#define RELAY1_PULSE_MODE RELAY_PULSE_OFF // defaults to being off (not watering)
#define RELAY1_PULSE_TIME 20 // number of seconds the relay can stay on for

// Built-in flash button
#define BUTTON1_PIN 0
#define BUTTON1_CONFIG BUTTON_PUSHBUTTON | BUTTON_DEFAULT_HIGH
#define BUTTON1_LNGCLICK BUTTON_ACTION_NONE

// Extra external button
#define BUTTON2_PIN 14
#define BUTTON2_CONFIG BUTTON_PUSHBUTTON | BUTTON_SET_PULLUP | BUTTON_DEFAULT_HIGH
#define BUTTON2_PRESS BUTTON_ACTION_PULSE
#define BUTTON2_CLICK BUTTON_ACTION_NONE
#define BUTTON2_RELEASE BUTTON_ACTION_OFF
#define BUTTON2_DBLCLICK BUTTON_ACTION_TOGGLE
#define BUTTON2_RELAY 1

// Float sensor
#define DIGITAL1_PIN 12


// Secret Configuration
#include "credentials.h"
</pre>
</div>
</li>
</ol>
</li>

<li><a id="org68a7727"></a>Compile firmware<br />
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Plug in the ESP8266 board via USB.
</p>

<p>
Some times you may need to reflash the entire ESP8266 memory to avoid issues,
Use `esptool.py erase_flash` to do that before running the above commands if you encounter random crashes.
</p>

<p>
From espurna/code run `./build.sh` to compile the project and flash it to a connected deivce.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org191050b" class="outline-4">
<h4 id="org191050b"><span class="section-number-4">1.3.3</span> Configure ESPurna</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
You also have to decide now if you want to run HomeAssistant to manage the watering device (more features and stuff)
or just use the device its self (easier).
Now that ESPurna is flashed, we have a few options we can change on the following tabs.
Make sure to hit save on every page.
</p>
</div>

<ol class="org-ol">
<li><a id="org233f949"></a>General<br />
<div class="outline-text-5" id="text-1-3-3-1">
<p>
Set the host name to something that makes sense like "PlantWater".
</p>
</div>
</li>

<li><a id="orgf9d0dcb"></a>HASS<br />
<div class="outline-text-5" id="text-1-3-3-2">
<ul class="org-ul">
<li>Enable discovery.</li>
<li>Leave the prefix as homeassistant if you don't know what this does. Its default.</li>
<li>Retain to yes. This means Home Assistant sees if the device has ever existed and adds it rather than waiting for it to say "Hello".</li>
</ul>
</div>
</li>

<li><a id="org43781be"></a>MQTT<br />
<div class="outline-text-5" id="text-1-3-3-3">
<p>
Enable if it isn't already.
Also enter your HomeAssistant broker details here if you aren't using your own broker.
This needs to be done after HomeAssistant is setup.
</p>
</div>
</li>

<li><a id="org107ffa0"></a>NPT<br />
<div class="outline-text-5" id="text-1-3-3-4">
<p>
Set your timezone by finding it in the list at <a href="https://github.com/esp8266/Arduino/blob/master/cores/esp8266/TZ.h">https://github.com/esp8266/Arduino/blob/master/cores/esp8266/TZ.h</a>.
Then copy the bit between the quotes and paste it into the Time Zone field.
</p>
</div>
</li>

<li><a id="org0e02343"></a>Schedule<br />
<div class="outline-text-5" id="text-1-3-3-5">
<p>
If you don't want to use HomeAssistant to control plant watering, just add a watering schedule here.
With Pulse Mode on you should only have to set a turn on schedule, the switch will turn off after the pulse time.
</p>
</div>
</li>

<li><a id="org003e5ec"></a>Sensors<br />
<div class="outline-text-5" id="text-1-3-3-6">
<ul class="org-ul">
<li>Read interval is how often to check whether the water is empty or not. Set it accordingly to something like 1 minute.</li>
<li>Change "Report every" to 1.</li>
</ul>
</div>
</li>

<li><a id="org4082da9"></a>Switches<br />
<div class="outline-text-5" id="text-1-3-3-7">
<p>
Setting first, the value after the colons.
</p>

<dl class="org-dl">
<dt>Boot mode</dt><dd>Always Off</dd>
<dt>Pulse mode</dt><dd>Normally Off</dd>
<dt>Pulse time</dt><dd>The maximum time we should be able to water the plant. It auto-stops watering after this many seconds if you don't turn it off.</dd>
<dt>MQTT topic subscription</dt><dd>Set this to something like "PlantWater/water" if using HomeAssistant. Home Assistant uses this to tell it to water the plants.</dd>
<dt>On MQTT disconnect</dt><dd>Turn off</dd>
</dl>
</div>
</li>

<li><a id="org5299e3c"></a>WiFi<br />
<div class="outline-text-5" id="text-1-3-3-8">
<p>
Here you can add more WiFi networks and change the WiFi password.
If you only have one WiFi network, turn off Scan. This results in better performance when the WiFi signal is low.
</p>
</div>
</li>
