information.org
**** Debug
     This just lists what the device is doing. You can also use it to turn things on and off, see for details https://github.com/xoseperez/espurna/wiki/Terminal.
     
*** Install HomeAssistant
    Go through the Getting Started guide at https://www.home-assistant.io/getting-started/.
    
    Once you have HomeAssistant up and running, if you have a dedicated MQTT server: https://www.home-assistant.io/docs/mqtt/broker/.

    If you don't have a dedicated MQTT server: https://github.com/home-assistant/addons/blob/master/mosquitto/DOCS.md

    Install the File Editor Addon: https://www.home-assistant.io/getting-started/configuration/

*** Configure HomeAssistant
    Configure the broker URL information to use your dedicated server or the MQTT Server Addon.
    You should see your Plant Water device in Configuration > Devices.

**** Configure Water Button
     Use the File Editor addon to edit the configuration.yaml file.
     Add the following in and make changes. The PlantWater should be changed to the Hostname of your device.
     After making changes, go to Configuration > Server Controls > Restart.
     If there are any errors they will show up in Configuration > Logs.
     On the Overview page you should now have a switch that when toggled, waters the plant, then toggles its self off again (thanksto pulse mode on ESPurna).
     
     #+BEGIN_SRC
switch:
  - platform: mqtt
    unique_id: watering_plant
    name: Watering Plant
    state_topic: "PlantWater/relay/0"
    command_topic: "PlantWater/water"
    payload_on: 1
    payload_off: 0
    optimistic: false
    qos: 2
    retain: false
     #+END_SRC

**** Make the water level sensor nicer
     A water level of 0 or 1 is fine and all, but "Not Empty" and "Empty" is nicer. This does that.
     Do the same as configuring the water button but with the below stuff now a new sensor will show up on Overview.
     
     #+BEGIN_SRC
sensor:
  - platform: template
    sensors:
        plant_water_level:
          friendly_name: Plant Water Level
          unique_id: sensor.plant_water_level
          value_template: >
            {% if is_state('sensor.plantwater_digital_0', '0') %}
              Not Empty
            {% else %}
              Empty
            {% endif %}
          icon_template: >
            {% if is_state('sensor.plantwater_digital_0', '0') %}
              mdi:flask-full
            {% else %}
              mdi:flask-empty
            {% endif %}
     #+END_SRC
     
***** Change the state_topic and command_topic
      The command_topic is set to the the MQTT topic subscription value on your ESPurna.
      HomeAssistant posts to this topic to tell the ESP8266 to water or not to water the plants.
      
      The state_topic is your hostname /relay/0. It should have the state of the ESP8266
      relay every time it changes, or the state of the plant watering.
       
***** Change sensor.plantwater_digital_0
      Save your changes and go to the Overview page.
      Click on the Plant Water device with a 0 or 1 next to it (or what ever you called it).
      Click the gear (settings) icon.
      Copy the Entity ID (something like sensor.hplantwater_digital_0).
      Back to the File Editor and paste it in place of sensor.platwater_digital_0 in both places.


*** Problems and Solutions
**** Don't See Plant Water Device in Home Assistant
     Check whether it has made a post at homeassistant/# by using a MQTT client to subscript to that.
     If there is one, the problem is with HomeAssistant.
     
     If you can't subscribe, the problem is with the MQTT broker (try starting it in HomeAssistant if you used the addon).

     If there is nothing there, the problem is your ESP8266.
     You might have to setup MQTT on the ESP8266 with a host, username, password, and such so it can connect to the MQTT broker.

     Also make sure your firewall allows the port that your MQTT broker is using.
**** Random Crashing and restarting
     Identified by looking at the serial output, basically it says it restarted or that it crashed.
     It may also say its in Fail Safe mode.
     Use the RST button once its connected to see all the serial output, and make sure the Arduino IDE serial monitor is set to 115200 baud rate.

***** Try erasing the flash
      Use `esptool.py --port /dev/ttyUSB0 erase_flash`.
      It seems that when developing and flashing, sometimes it leaves code in the flash that breaks stuff.

***** Disable features
      Try commenting out the LED stuff in custom.h. I have found that can cause problems.
      Also try commenting out other entire features or disabling things and reflashing.

***** Update ESPurna Git
      You can navigate into espurna/code and do 'git pull upstream'.
      Then save the merge file it opens and try building with any new changes in development.

***** Create an issue on this Github repo
      I'll see if I can help out or fix the problem.

