information.html

<li><a id="orgf862a6b"></a>Debug<br />
<div class="outline-text-5" id="text-1-3-3-9">
<p>
This just lists what the device is doing. You can also use it to turn things on and off, see for details <a href="https://github.com/xoseperez/espurna/wiki/Terminal">https://github.com/xoseperez/espurna/wiki/Terminal</a>.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge2a5334" class="outline-4">
<h4 id="orge2a5334"><span class="section-number-4">1.3.4</span> Install HomeAssistant</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Go through the Getting Started guide at <a href="https://www.home-assistant.io/getting-started/">https://www.home-assistant.io/getting-started/</a>.
</p>

<p>
Once you have HomeAssistant up and running, if you have a dedicated MQTT server: <a href="https://www.home-assistant.io/docs/mqtt/broker/">https://www.home-assistant.io/docs/mqtt/broker/</a>.
</p>

<p>
If you don't have a dedicated MQTT server: <a href="https://github.com/home-assistant/addons/blob/master/mosquitto/DOCS.md">https://github.com/home-assistant/addons/blob/master/mosquitto/DOCS.md</a>
</p>

<p>
Install the File Editor Addon: <a href="https://www.home-assistant.io/getting-started/configuration/">https://www.home-assistant.io/getting-started/configuration/</a>
</p>
</div>
</div>

<div id="outline-container-orgdc51cfe" class="outline-4">
<h4 id="orgdc51cfe"><span class="section-number-4">1.3.5</span> Configure HomeAssistant</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Configure the broker URL information to use your dedicated server or the MQTT Server Addon.
You should see your Plant Water device in Configuration &gt; Devices.
</p>
</div>

<ol class="org-ol">
<li><a id="org0d248a0"></a>Configure Water Button<br />
<div class="outline-text-5" id="text-1-3-5-1">
<p>
Use the File Editor addon to edit the configuration.yaml file.
Add the following in and make changes. The PlantWater should be changed to the Hostname of your device.
After making changes, go to Configuration &gt; Server Controls &gt; Restart.
If there are any errors they will show up in Configuration &gt; Logs.
On the Overview page you should now have a switch that when toggled, waters the plant, then toggles its self off again (thanksto pulse mode on ESPurna).
</p>

<pre class="example">
switch:
  - platform: mqtt
    unique_id: watering_plant
    name: Watering Plant
    state_topic: "PlantWater/relay/0"
    command_topic: "PlantWater/water"
    payload_on: 1
    payload_off: 0
    optimistic: false
    qos: 2
    retain: false
</pre>
</div>
</li>

<li><a id="org8ef966f"></a>Make the water level sensor nicer<br />
<div class="outline-text-5" id="text-1-3-5-2">
<p>
A water level of 0 or 1 is fine and all, but "Not Empty" and "Empty" is nicer. This does that.
Do the same as configuring the water button but with the below stuff now a new sensor will show up on Overview.
</p>

<pre class="example">
sensor:
  - platform: template
    sensors:
        plant_water_level:
          friendly_name: Plant Water Level
          unique_id: sensor.plant_water_level
          value_template: &gt;
            {% if is_state('sensor.plantwater_digital_0', '0') %}
              Not Empty
            {% else %}
              Empty
            {% endif %}
          icon_template: &gt;
            {% if is_state('sensor.plantwater_digital_0', '0') %}
              mdi:flask-full
            {% else %}
              mdi:flask-empty
            {% endif %}
</pre>
</div>

<ol class="org-ol">
<li><a id="org7b8c29c"></a>Change the state_topic and command_topic<br />
<div class="outline-text-6" id="text-1-3-5-2-1">
<p>
The command_topic is set to the the MQTT topic subscription value on your ESPurna.
HomeAssistant posts to this topic to tell the ESP8266 to water or not to water the plants.
</p>

<p>
The state_topic is your hostname /relay/0. It should have the state of the ESP8266
relay every time it changes, or the state of the plant watering.
</p>
</div>
</li>

<li><a id="orgbb9f86c"></a>Change sensor.plantwater_digital_0<br />
<div class="outline-text-6" id="text-1-3-5-2-2">
<p>
Save your changes and go to the Overview page.
Click on the Plant Water device with a 0 or 1 next to it (or what ever you called it).
Click the gear (settings) icon.
Copy the Entity ID (something like sensor.hplantwater_digital_0).
Back to the File Editor and paste it in place of sensor.platwater_digital_0 in both places.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>


<div id="outline-container-org97281e9" class="outline-4">
<h4 id="org97281e9"><span class="section-number-4">1.3.6</span> Problems and Solutions</h4>
<div class="outline-text-4" id="text-1-3-6">
</div>
<ol class="org-ol">
<li><a id="orgf6a8ea5"></a>Don't See Plant Water Device in Home Assistant<br />
<div class="outline-text-5" id="text-1-3-6-1">
<p>
Check whether it has made a post at homeassistant/# by using a MQTT client to subscript to that.
If there is one, the problem is with HomeAssistant.
</p>

<p>
If you can't subscribe, the problem is with the MQTT broker (try starting it in HomeAssistant if you used the addon).
</p>

<p>
If there is nothing there, the problem is your ESP8266.
You might have to setup MQTT on the ESP8266 with a host, username, password, and such so it can connect to the MQTT broker.
</p>

<p>
Also make sure your firewall allows the port that your MQTT broker is using.
</p>
</div>
</li>
<li><a id="org3d9ca6f"></a>Random Crashing and restarting<br />
<div class="outline-text-5" id="text-1-3-6-2">
<p>
Identified by looking at the serial output, basically it says it restarted or that it crashed.
It may also say its in Fail Safe mode.
Use the RST button once its connected to see all the serial output, and make sure the Arduino IDE serial monitor is set to 115200 baud rate.
</p>
</div>

<ol class="org-ol">
<li><a id="org0101906"></a>Try erasing the flash<br />
<div class="outline-text-6" id="text-1-3-6-2-1">
<p>
Use `esptool.py &#x2013;port /dev/ttyUSB0 erase_flash`.
It seems that when developing and flashing, sometimes it leaves code in the flash that breaks stuff.
</p>
</div>
</li>

<li><a id="org09a0c91"></a>Disable features<br />
<div class="outline-text-6" id="text-1-3-6-2-2">
<p>
Try commenting out the LED stuff in custom.h. I have found that can cause problems.
Also try commenting out other entire features or disabling things and reflashing.
</p>
</div>
</li>

<li><a id="orgb16ec08"></a>Update ESPurna Git<br />
<div class="outline-text-6" id="text-1-3-6-2-3">
<p>
You can navigate into espurna/code and do 'git pull upstream'.
Then save the merge file it opens and try building with any new changes in development.
</p>
</div>
</li>

<li><a id="orge79cc66"></a>Create an issue on this Github repo<br />
<div class="outline-text-6" id="text-1-3-6-2-4">
<p>
I'll see if I can help out or fix the problem.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-20 Tue 14:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
